{
  "welcome": "Welcome to the app!",
  "description": "Hello, I'm Erick, a 21-year-old web programming enthusiast. Currently, I'm studying a Software Development and Management Engineering. Programming has become a daily habit due to my enthusiasm for technology. I'm specializing in the frontend area. I love learning new technologies and staying up to date with the latest trends in web development. In my free time, I enjoy playing video games and practicing basketball.",
  "about": "About me",
  "projects": "Projects",
  "contact": "Contact",
  "skills": "Skills",
  "education": "Education",
  "portfolio": "Portfolio",
  "experience": "Experience",
  "ViewonGitHub": "View on GitHub",
  "DesProject": "No Preview Description",
  "titleexp1": "Developer Fullstack",
  "titleexp2": "Notitas",
  "fechaexp1": "January 2025 – currently",
  "fechaexp2": "May 2024 – August 2024",
  "Projectofclass": "Class Project",
  "descexp1": "I am a web application developer, currently working on the development of Oomapas-Nogales as a full-stack developer, using the most current technologies for web application development.",
  "descexp2": "I developed a note-taking application with React, Node.js, Express, and MongoDB. The application allowed users to create, edit, and delete notes, as well as authenticate and store notes in the database, the user can also share notes with other users by creating groups.",
  "puntoexp1.1": "● I implemented the user interface in React and TypeScript, prioritizing accessibility and user experience.",
  "puntoexp1.2": "● I collaborated in the development of the backend, using Node.js, to ensure a scalable and efficient architecture.",
  "puntoexp1.3": "● I designed user manuals and technical guides for developers, facilitating the understanding of the platform.",
  "puntoexp1.4": "● Result: A modern educational solution that demonstrated teamwork skills, agile development, and handling cutting-edge technologies.",
  "puntoexp2.1": "● I implemented reusable components, optimizing project development and maintenance.",
  "puntoexp2.2": "● We designed the application with a hexagonal architecture, facilitating the separation of responsibilities and ensuring efficient scalability.",
  "puntoexp2.3": "● Notitas allows users to organize daily tasks, add quick notes, and create groups to share information with friends in an intuitive way.",
  "puntoexp2.4": "● Result: An innovative multiplatform solution that demonstrated skills in architecture design and team collaboration.",
  
  "college": "Technological University of Nogales Sonora.",
  "carrer": "Software Development and Management Engineering",
  "date": "September 2021 - April 2025",
  "profesional": "FrontEnd Developer"
}
